Revit 2026 API

# MaterialDuplicate Method

---

Duplicates the material

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Material Duplicate(
	string name
)
```
```vb
Public Function Duplicate (
	name As String
) As Material
```
```cpp
public:
Material^ Duplicate(
	String^ name
)
```
```fsharp
member Duplicate :
        name : string -> Material
```

#### Parameters

name String
     Name of the new material - this name must be correctly structured for Revit use and not duplicate the name of another material in the document.

#### Return Value

Material The new material.

| Exception | Condition |
| --- | --- |
| ArgumentException | name cannot include prohibited characters, such as "{, }, [, ], | , ;, less-than sign, greater-than sign, ?, `, ~". -or- The given value for name is already in use as a material element name. |
| ArgumentNullException | A non-optional argument was null |

If duplication fails for reasons unrelated to the name,  will be returned.

#### Reference

Material Class

Autodesk.Revit.DB Namespace